package ru.magarusik.head.one.tasks_two;

public class Task3 {
    /*
    Предположим, а и b — переменные типа boolean. Покажите, что результат
    выражения ( !(а && Ь) && (а !! Ь)) || ((а && Ь) || !(а || Ь)) равен true.
     */
    public static void main(String[] args) {
        boolean a = true;
        boolean b = false;
        System.out.println((!(a && b) && (a || b)) || ((a && b) || !(a || b)));
    }

    /*
    | a | b | a && b | a || b | !(a && b) | !(a && b) && (a || b) | !(a || b) | (a && b) || !(a || b) | Result |
    +---------------------------------------------------------------------------------------------------------+
    | 0 | 0 |    0   |   0    |     1     |       0               |     1     |           1           |    1   |
    | 0 | 1 |    0   |   1    |     1     |       1               |     0     |           0           |    1   |
    | 1 | 0 |    0   |   1    |     1     |       1               |     0     |           0           |    1   |
    | 1 | 1 |    1   |   1    |     0     |       0               |     0     |           0           |    1   |
    +----------------------------------------------------------------------------------------------------------+
     */
}
